In [1]:
import numpy as np
import pandas as pd
from scipy import stats

Q2.   A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

State the null and alternative hypotheses:

Null Hypothesis (H0): The average TAT is the same for all laboratories.

Alternative Hypothesis (Ha): At least one laboratory has a different average TAT from the others.

In [2]:
df = pd.read_csv('LabTAT.csv')

In [3]:
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [5]:
df.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [6]:
# Perform one-way ANOVA
f_statistic, p_value = stats.f_oneway(df['Laboratory 1'], df['Laboratory 2'], df['Laboratory 3'], df['Laboratory 4'])

# Set the significance level
alpha = 0.05

# Print the results
print("F-statistic:", f_statistic)
print("P-value:", p_value)
print()

# Determine if the p-value is less than the significance level
if p_value < alpha:
    print("Answer(Q2):Reject the null hypothesis. There is a significant difference in average TAT among the laboratories.")
else:
    print("Fail to reject the null hypothesis. There is no significant difference in average TAT among the laboratories.")

F-statistic: 118.70421654401437
P-value: 2.1156708949992414e-57

Answer(Q2):Reject the null hypothesis. There is a significant difference in average TAT among the laboratories.